app/controllers/students_controller.rb

  def create
  	house = House.all.sample
  	@student = house.students.new(student_params)
  	if @student.save
---
INSERT INTO "students" ("created_at", "house_id", "img_url", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"